import React, {Component} from 'react';
import {Tab, Col, Row, Nav, Sonnet} from 'react-bootstrap'

class Description extends Component {
    render() {
        return (
            <div>
                <Tab.Container id="left-tabs-example" defaultActiveKey="z">
                    <Row>
                        <Col sm={3}>
                            <Nav variant="pills" className="flex-column">
                                <Nav.Item>
                                    <Nav.Link eventKey="z">Just a Lёha</Nav.Link>
                                </Nav.Item>
                                <Nav.Item>
                                    <Nav.Link eventKey="first">Искуственный интеллект</Nav.Link>
                                </Nav.Item>
                                <Nav.Item>
                                    <Nav.Link eventKey="second">Коммуникабельность</Nav.Link>
                                </Nav.Item>
                                <Nav.Item>
                                    <Nav.Link eventKey="s">Увеличенный объем батареи</Nav.Link>
                                </Nav.Item>
                                <Nav.Item>
                                    <Nav.Link eventKey="e">Объяснение всей написанной тут хуйни</Nav.Link>
                                </Nav.Item>
                                <Nav.Item>
                                    <Nav.Link eventKey="c">P.S.</Nav.Link>
                                </Nav.Item>
                            </Nav>
                        </Col>
                        <Col sm={9}>
                            <Tab.Content>
                                <Tab.Pane eventKey="first">
                                    >>625128 я тебе открою страшную тайну. У меня есть друг. Он трахнул бабу. Инфа 100%я, так как он все заснял на видео-камеру. Так вот, когда я ему дал ссылку на Двач, он сказал что у него не захоидт. Я не поверил, и поехал к нему домой. И правда, вместо Двача у него показывает 404! Я стал ковыряться в его компе. Леха сначала смотрел на мои попытки с ухмылкой, а потом пошел на кухню за пивом. Как только он вышел из комнаты, Двач заработал. Но через 5 минут Леха вернулся и принес две банки пива и кальмаров. Двач тут же отрубился!!!

                                    Двач!!! Сюда пускают только девственников!!!
                                    /b/ — Бред, Пнд 24 Сен 2007 00:22:25 №625145
                                </Tab.Pane>
                                <Tab.Pane eventKey="second">
                                    да, среди /b/тардов очень много всякого быдла из школ, вузов, которые читают фишки.нет, исправно ведут жежешечку и парются о числе френдов, с пеной у рта выбивают инвайт на лепру и прочее, короче, веб-стадо. куда все — туда они. причем чем менее известно место, тем более оно «престижно». было время когда только начинал становиться популярным падонковский слэнг, несмотря на то что зародился он за десять с лишним лет до этого, потом дерти, потом уже лепра/упячка, определенные люди на жж («А У МЕНЯ В ДРУЗЬЯХ ГОБЛИН ГАГА И НОСИК»). а вот щас такие пидоры добрались до двача. и они понтуются на сторонних ресурсах двач-сленгом, а собсно на дваче они никогда не могут из себя родить что-нибудь истинно винрарное и морально мастурбируют повторяя одно и то же «сосни хуйца, быдло», «двачую» и прочие фразы, которые не всегда уместны даже в таком изначально е-рейдж-базированном коллективе. и двач из-за них становится похож на какую-нибудь упячку, где клевым считается просто по поводу и без повторять «ПЫЩ ПЫЩ ЖЕПЬ ЕБРИЛО Я ЕБАНУЛСЯ!!1».

                                    НО! Если отбросить все это хуйло, остальные /b/тарды, по сути, являются умными людьми. даже нет, они являются своего рода элитой, интеллигенцией рунета. просто отзывчивость и сострадание — это вовсе не черты, сопутствующие понятию «нормальные люди». мы все здесь — анонимусы. но даже в этом сером безличном образе очень легко увидеть, кто клацает по клавишам — очередное тупое быдло или человек, попавший на двач не просто так, а имеющий «мечту, выебанную в последний раз» ©
                                </Tab.Pane>
                                <Tab.Pane eventKey="s">
                                    Двач превратился в говно. Жалкое, унылое серое говнецо с запашком типо силит-бэнг. Реквестирую вайп-хуяйп неграми, говном, цп, хуйпиздой, задротами, кастратами, резиновыми женщинами, быдлосмайликами, крашенными заборами, лесенками и веточками, табачником, бабами, плесенью, серебристым фламингой, котами-забияками, серыми разбойниками, клавишей цэ, уёбищными сёстрами-близняшками, женственными мужчинами, какашечками, качественным серым отсосом, дефлорацией, мизантропами, характерыми зелёными кляксами, мертвечинкой, тупыми быдланами и домом с трубой.
                                </Tab.Pane>
                                <Tab.Pane eventKey="e">
                                    Время блять 10 утра, нет нахуй, серьезно, я не спал уже 32 года. Кофе и конфеты перестали оказывать положительный эффект на мою активность и именно блять по этому я просто вставил сюда копипасты с двача. Ну точнее, если быть совсем точным, на данный момент я ещё ничего пока сюда не вставил,а пишу вот эту вот хуйню. О боже. А нахуя я вообще это пишу? Можно мне выйти блять покурить? ДА? Спасибо. Я пошел курить, иди нахуй :*
                                </Tab.Pane>
                                <Tab.Pane eventKey="c">
                                    Я покурил. В общем тут должны были быть пикчи, анимашки, и прочее говно интересное, но суть всего этого заключалось в другом. Теперь я изи ебану любое подобное задание за битые пару часов.
                                </Tab.Pane>
                                <Tab.Pane eventKey="z">
                                    Just a Lёha - новейшие био-робот во всем блядском сука мире. О да. Нахуй он вообще нужен? А я расскажу тебе, сука, допустим у тебя нет отца, ты покупаешь себе ДЖАСТ Э ЛЁХА и теперь у тебя есть отец. Твой бойфренд стал дохуя пиздеть? Есть решение - ДЖАСТ Э ЛЁХА. Не с кем прибухнуть пива? ДЖАСТ Э ЛЁХА с радостью скажет "бонжур, бедолага". ДЖАСТ Э ЛЁХА - НАШ ОТВЕТ ЯПОНСКИМ СЕКС-РОБОТАМ. ДЖАСТ Э ЛЁХА - иди в ногу с временем, ты вообще время видел? Магаз закрывается через 3 минуты, а ты без бухла? ДЖАСТ Э ЛЁХААААААА
                                </Tab.Pane>
                            </Tab.Content>
                        </Col>
                    </Row>
                </Tab.Container>
            </div>
        );
    }
}

export default Description;